{
    "projects": [
          {
        "title": "About Me", 
        "img-src": "https://pub-466fc3a931564b4a9314c6dd67100395.r2.dev/giraffe.jpg", 
        "img-alt": "About me picture (of giraffe)", 
        "description": "My name is Matthew Williams, a software engineering major at the University of California, San Diego, where I am hoping to graduate by December. I will then look for a job to apply what I learned during my time here at UCSD, hopefully on a large project I am interested in/subject I am passionate about. The link below the image of my favorite animal (the Giraffe) should bring you to my linkedin to learn more about who I am professionally. ", 
        "link": "https://www.linkedin.com/in/matthew-williams-4337942b6/"
        },
        {
        "title": "Hobbies/Interests", 
        "img-src": "https://pub-466fc3a931564b4a9314c6dd67100395.r2.dev/landscapewidemobile3x-stock-weights-169.jpg", 
        "img-alt": "Picture of weights", 
        "description": "As far as hobbies I enjoy outside of work/school, the first one that comes to mind would be weightlifting. I have been consistently weightlifting for upwards of 4 years meaning that I am not only developing my brain at school, but also having the discipline to develop my body at the same time. In addition to this, I enjoy cooking/baking as well as sewing and surfing, and spending time with my family and friends. The link below the dumbbells will take you to my school's website, to le", 
        "link": "https://ucsd.edu/"
        },
        {
        "title": "Featured Project", 
        "img-src": "https://pub-466fc3a931564b4a9314c6dd67100395.r2.dev/ss.png", 
        "img-alt": "Screenshot of My Featured Project", 
        "description": "The project that I chose to feature is my group project from a class I took last year called Software Engineering. This project taught me quite a bit about HTML, CSS, and JavaScript, as well as Agile practices. I worked in a team setting to develop a journal for software engineers to write down what they did that day and included features like a password page complete with an encryption to make the journal feel safe, a calendar to mark important dates/track meetings, and markdown support to easily transfer the code you pushed to the journal. The link below brings you to the github repository of the project I described.", 
        "link": "https://github.com/cse110-sp24-group12/cse110-sp24-group12"
        }
    ]
  }
  
